# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'leoafarias/fvm'

# Binaries
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'pkg-config'
brew 'svn'
brew 'fd'
brew 'ripgrep'

brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

brew 'php'
brew 'composer'
brew 'imagemagick'
brew 'mysql'
brew 'nginx'
brew 'n'
brew 'redis'

brew 'fvm'

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'imageoptim'
cask 'phpmon'
cask 'ray'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'rectangle'
cask 'tableplus'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Bear' id: 1091189122
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Tweetbot', id: 1384080005
